{
  "cards": [
    {
      "id": 1,
      "name": "Linux Dotfiles",
      "description": {
        "en": "My dynamically-themed Linux dotfiles and config script for my every-day workflow using Hyprland. Meant to be easily installed on any base Arch installation.",
        "fr": "Mes dotfiles Linux à thème dynamique et script de configuration pour mon flux de travail quotidien utilisant Hyprland. Conçu pour être facilement installé sur toute installation Arch de base."
      },
      "importance": "100",
      "preview": "./dotfiles.png",
      "file": "https://github.com/eiiko6/dotfiles"
    },
    {
      "id": 2,
      "name": "Spotify Data",
      "description": {
        "en": "A front-end app written in TypeScript that fetches data from your Spotify account.",
        "fr": "Une application front-end écrite en TypeScript qui récupère les données de votre compte Spotify."
      },
      "importance": "50",
      "preview": "./spotistats.png",
      "file": "https://github.com/eiiko6/spotify-data"
    },
    {
      "id": 3,
      "name": "RPG battle player",
      "description": {
        "en": "A Python app that animates battles with init settings. It was made for a big RPG game in school.",
        "fr": "Une application Python qui anime des batailles avec des paramètres initiaux. Elle a été créée pour un RPG grandeur nature organisé au lycée."
      },
      "importance": "40",
      "preview": "./rpg.png",
      "file": "https://github.com/eiiko6/DOPJB-2024"
    },
    {
      "id": 4,
      "name": "ShinyBot",
      "description": {
        "en": "An old-deprecated multifunctional Discord bot written in JavaScript during the pandemic. It was my first programming project.",
        "fr": "Un ancien bot multifonction Discord obsolète écrit en JavaScript pendant la pandémie. C'était mon premier projet de programmation."
      },
      "importance": "30",
      "preview": "./shinybot.png",
      "file": "https://github.com/eiiko6/ShinyBot"
    },
    {
      "id": 5,
      "name": "Flappigeon",
      "description": {
        "en": "A small mobile game made with Unity. It was a collaboration with an artist friend.",
        "fr": "Un petit jeu mobile créé avec Unity. C'était une collaboration avec un ami artiste."
      },
      "importance": "20",
      "preview": "./flappigeon.png",
      "file": ""
    },
    {
      "id": 6,
      "name": "Linux config switcher",
      "description": {
        "en": "A small Bash script that allows you to quickly and seamlessly switch between multiple dotfiles configurations.",
        "fr": "Un petit script Bash qui vous permet de changer rapidement et de manière transparente entre plusieurs configurations de dotfiles."
      },
      "importance": "51",
      "preview": "./themeswitcher.png",
      "file": "https://github.com/eiiko6/theme-switcher"
    },
    {
      "id": 7,
      "name": "Arch Linux installation script",
      "description": {
        "en": "A shell script that does a minimal Arch installation for you, on any drive specified.",
        "fr": "Un script shell qui effectue une installation minimale d'Arch pour vous, sur n'importe quel disque spécifié."
      },
      "importance": "41",
      "preview": "./archinstall.png",
      "file": "https://github.com/eiiko6/arch-installer"
    },
    {
      "id": 8,
      "name": "hyprkeymap",
      "description": {
        "en": "A Hyprland key bindings manager written in C++",
        "fr": "Un gestionnaire de raccourcis clavier pour Hyprland, écrit en C++"
      },
      "importance": "60",
      "preview": "./bindings.png",
      "file": "https://github.com/eiiko6/hyprkeymap"
    },
    {
      "id": 9,
      "name": "Palette",
      "description": {
        "en": "A set of scripts to manage linux wallpapers and colorschemes with swww and wal.",
        "fr": "Un ensemble de scripts pour gérer les fonds d'écran sous Linux et les palettes de couleurs avec swww et wal."
      },
      "importance": "48",
      "preview": "./palette.png",
      "file": "https://github.com/eiiko6/palette"
    }
  ]
}
