{
  "cards": [
    {
      "id": 1,
      "name": "Linux Dotfiles",
      "description": {
        "en": "My dynamically-themed Linux dotfiles and config script for my every-day workflow using Hyprland. Meant to be easily installed on any base Arch installation.",
        "fr": "Mes dotfiles Linux à thème dynamique et script de configuration pour mon flux de travail quotidien utilisant Hyprland. Conçu pour être facilement installé sur toute installation Arch de base."
      },
      "importance": "100",
      "preview": "./dotfiles.png",
      "file": "https://github.com/eiiko6/dotfiles",
      "categories": [
        "Linux & Config",
        "Scripting & Automation"
      ],
      "details": {
        "fr": "<h3>Contexte</h3>J'utilise Arch Linux avec Hyprland, une configuration qui encourage à bâtir soi-même son environnement.<h3>Objectifs</h3>J'essaie de créer un environnement de travail sans distractions, qui ne sacrifie pas son apparence.</br>Toute la navigation est au clavier, et de nombreux outils sont intégrés pour intéragir entre eux afin d'atteindre une productivité maximale.",
        "en": "<h3>Context</h3>I use Arch Linux with Hyprland, a setup that encourages building your own environment.<h3>Goals</h3>I'm aiming to create a distraction-free work environment that doesn't compromise on looks. Everything is keyboard-driven, and many tools are integrated to interact with each other for maximum productivity."
      }
    },
    {
      "id": 2,
      "name": "Spotify Data",
      "description": {
        "en": "A front-end app written in TypeScript that fetches data from your Spotify account.",
        "fr": "Une application front-end écrite en TypeScript qui récupère les données de votre compte Spotify."
      },
      "importance": "50",
      "preview": "./spotistats.png",
      "file": "https://github.com/eiiko6/spotify-data",
      "categories": [
        "Web & Frontend",
        "APIs & Integration",
        "Data & Analysis"
      ],
      "details": {
        "fr": "<h3>Contexte</h3>J'ai longtemps eu besoin d'un moyen de voir quels titres et artistes j'écoute le plus sur Spotify. Il se trouve qu'il existe une API officielle permettant d'accéder à ces données. J'ai choisi de créer une petite plateforme qui demande à l'utilisateur de connecter son compte Spotify, sécurisé avec OAuth 2.0. Les requetes sont faites en TypeScript.<h3>Compétences acquises</h3>J'ai appris à me documenter sur une API, et à créer des requetes sécurisées tout en respectant les taux et fréquences autorisées.",
        "en": "<h3>Context</h3>I’ve always wanted a way to view my most listened tracks and artists on Spotify. It turns out there's an official API to access this data. I decided to build a small platform where users can connect their Spotify accounts via OAuth 2.0. The requests are made in TypeScript.<h3>Skills developed</h3>I learned how to research and use an API, and how to make secure, rate-compliant queries."
      }
    },
    {
      "id": 3,
      "name": "RPG battle player",
      "description": {
        "en": "A Python app that animates battles with init settings. It was made for a big RPG game in school.",
        "fr": "Une application Python qui anime des batailles avec des paramètres initiaux. Elle a été créée pour un RPG grandeur nature organisé au lycée."
      },
      "importance": "40",
      "preview": "./rpg.png",
      "file": "https://github.com/eiiko6/DOPJB-2024",
      "categories": [
        "Software Development"
      ],
      "details": {
        "fr": "<h3>Contexte</h3>Mon lycée a organisé un jeu de rôles grandeur nature comme évènement de fin d'année. J'ai eu la chance d'être au coeur de la création du projet, et en tant que seul développeur j'ai commencé à créer une application en Python.<br/>Le choix du langage était justifié par l'attente d'autres développeurs: Python est plus accessible.<h3>Objectifs</h3>Le projet s'est avéré très ambitieux: la deadline est arrivée très vite. J'ai du créer un système d'interprétation de documents Excel pour pouvoir déléguer la conception des données et l'équilibrage à d'autres membres de l'équipe. J'ai aussi participé à la direction artistique.<h3>Compétences acquises</h3>J'ai appris à déléguer des taches à une équipe. J'ai appris des bases sur les structures de données et l'algorithmie en Python.",
        "en": "<h3>Context</h3>My high school organized a live-action role-playing game for the end of the year. I was at the heart of the project and, as the only developer, I began creating a Python application.<br/>The language choice was justified by accessibility for others.<h3>Goals</h3>The project turned out to be very ambitious, and deadlines came fast. I had to create a system to interpret Excel files so I could delegate data design and balancing to others. I also took part in the artistic direction.<h3>Skills developed</h3>I learned to delegate tasks to a team and gained fundamentals in data structures and algorithms in Python."
      }
    },
    {
      "id": 4,
      "name": "ShinyBot",
      "description": {
        "en": "An old-deprecated multifunctional Discord bot written in JavaScript during the pandemic. It was my first programming project.",
        "fr": "Un ancien bot multifonction Discord obsolète écrit en JavaScript pendant la pandémie. C'était mon premier projet de programmation."
      },
      "importance": "30",
      "preview": "./shinybot.png",
      "file": "https://github.com/eiiko6/ShinyBot",
      "categories": [
        "APIs & Integration"
      ],
      "details": {
        "fr": "<h3>Contexte</h3>Pendant la pandémie, j'ai modéré un serveur Discord. J'ai eu envie de créer un bot pour automatiser la gestion des utilisateurs et des droits.<h3>Compétences acquises</h3>J'ai appris à créer une application serveur qui intéragit avec une API. J'ai appris à modulariser un projet, et à ne pas partager mes clés privées sur un dépot public 😭",
        "en": "<h3>Context</h3>During the pandemic, I moderated a Discord server. I wanted to create a bot to automate user and permission management.<h3>Skills developed</h3>I learned how to create a server-side app that interacts with an API. I learned to modularize a project — and not to share private keys on a public repo 😭"
      }
    },
    {
      "id": 5,
      "name": "Flappigeon",
      "description": {
        "en": "A small mobile game made with Unity. It was a collaboration with an artist friend.",
        "fr": "Un petit jeu mobile créé avec Unity. C'était une collaboration avec un ami artiste."
      },
      "importance": "20",
      "preview": "./flappigeon.png",
      "file": "",
      "categories": [
        "Software Development"
      ],
      "details": {
        "fr": "Pas de détails supplémentaires",
        "en": "No additional details"
      }
    },
    {
      "id": 6,
      "name": "dotswitch",
      "description": {
        "en": "A Rust program that allows you to quickly and seamlessly switch between multiple dotfiles configurations.",
        "fr": "Un programme en Rust qui permet de changer rapidement et de manière transparente entre plusieurs configurations de dotfiles."
      },
      "importance": "51",
      "preview": "./themeswitcher.png",
      "file": "https://github.com/eiiko6/dotswitch",
      "categories": [
        "Linux & Config",
        "System Tools",
        "Rust",
        "Scripting & Automation"
      ],
      "details": {
        "fr": "C'était beaucoup de gestion d'erreurs en Rust. Aussi du I/O, de la gestion de config, et du parsing d'arguments.",
        "en": "This was a lot of error management in Rust. And also I/O, config management and argument parsing."
      }
    },
    {
      "id": 7,
      "name": "Arch Linux installation script",
      "description": {
        "en": "A shell script that does a minimal Arch installation for you, on any drive specified.",
        "fr": "Un script shell qui effectue une installation minimale d'Arch pour vous, sur n'importe quel disque spécifié."
      },
      "importance": "41",
      "preview": "./archinstall.png",
      "file": "https://github.com/eiiko6/arch-installer",
      "categories": [
        "Linux & Config",
        "Scripting & Automation",
        "System Tools"
      ],
      "details": {
        "fr": "Pas de détails supplémentaires",
        "en": "No additional details"
      }
    },
    {
      "id": 8,
      "name": "hyprbindings",
      "description": {
        "en": "A Hyprland key bindings manager written in C++",
        "fr": "Un gestionnaire de raccourcis clavier pour Hyprland, écrit en C++"
      },
      "importance": "14",
      "preview": "./bindings.png",
      "file": "https://github.com/eiiko6/hyprbindings",
      "categories": [
        "Linux & Config",
        "Scripting & Automation",
        "System Tools"
      ],
      "details": {
        "fr": "Pas de détails supplémentaires",
        "en": "No additional details"
      }
    },
    {
      "id": 9,
      "name": "Palette",
      "description": {
        "en": "A set of scripts to manage linux wallpapers and colorschemes with swww and wal.",
        "fr": "Un ensemble de scripts pour gérer les fonds d'écran sous Linux et les palettes de couleurs avec swww et wal."
      },
      "importance": "48",
      "preview": "./palette.png",
      "file": "https://github.com/eiiko6/palette",
      "categories": [
        "Linux & Config",
        "Scripting & Automation"
      ],
      "details": {
        "fr": "Pas de détails supplémentaires",
        "en": "No additional details"
      }
    },
    {
      "id": 10,
      "name": "Ryn",
      "description": {
        "en": "A minimalist crossplatform shell written in Rust as a challenge for learning the language.",
        "fr": "Un shell minimaliste crossplatforme écrit en Rust pour un défi afin d'apprendre le langage."
      },
      "importance": "90",
      "preview": "./ryn.png",
      "file": "https://github.com/eiiko6/Ryn",
      "categories": [
        "Rust",
        "System Tools"
      ],
      "details": {
        "fr": "<h3>Contexte</h3>Dans mon apprentissage du langage Rust, j'ai décidé de créer un shell en partant de zéro: c'est un exercice passionnant qui permet d'explorer une partie de ce à quoi touche le langage.<h3>Objectifs</h3>Le shell implémente des fonctionnalités qui l'obligent à interagir avec les fichiers, à gérer du multithreading, et à utiliser des structures de données efficaces.<h3>Livrables</h3>Je documente au mieux possible le projet, et je fournis des analyses de qualité de code avec la CI de Github.<h3>Compétences acquises</h3>J'ai appris les bases du lanagage Rust, et ainsi les enjeux de la gestion et sécurité mémoire.<br/>Les contraintes du crossplatforme force l'utilisation de solutions durables et efficaces.",
        "en": "<h3>Context</h3>As part of learning Rust, I decided to build a shell from scratch — a great exercise to explore various aspects of the language.<h3>Goals</h3>The shell implements features that require file handling, multithreading, and efficient data structures.<h3>Products</h3>I aim to document the project thoroughly and provide code quality analysis with GitHub CI.<h3>Skills developed</h3>I learned the basics of Rust and the importance of memory safety. Cross-platform constraints forced me to adopt sustainable and efficient solutions."
      }
    },
    {
      "id": 11,
      "name": "Knights Wrath",
      "description": {
        "en": "An RPG-like rock paper scissors game. A group project aiming to use multiple sorting algorithms and data structures in C.",
        "fr": "Un jeu RPG de type pierre-feuille-ciseaux. Le but était d'utiliser plusieurs algorithmes de tri et structures de données en C."
      },
      "importance": "10",
      "preview": "./knight.png",
      "file": "",
      "categories": [
        "School Projects"
      ],
      "details": {
        "fr": "<h3>Contexte</h3>Dans ce projet de BUT, il nous était imposé des fonctionnalités de gestion de stages. Nous devions implémenter nos algorithmes et structures de données en C (tris, listes chaînées...). Nous étions en groupes de 2, en première collaboration avec Git.<h3>Compétences acquises</h3>C'était une occasion majeure pour apprendre comment fonctionne la mémoire, et comment sont structurés les conteneurs dans les langages de plus haut niveau.",
        "en": "<h3>Context</h3>This BUT project required us to implement internship management features. We had to implement our own sorting algorithms and data structures in C (like sorting, linked lists...). We worked in pairs, using Git for the first time.<h3>Skills developed</h3>It was a major opportunity to learn how memory works and how containers are structured in higher-level languages."
      }
    },
    {
      "id": 12,
      "name": "Internships",
      "description": {
        "en": "A C program for managing students and their internship stages. This was to learn about memory management.",
        "fr": "Un programme en C pour gérer les étudiants et leurs stages. Cela a servi à apprendre la gestion de la mémoire."
      },
      "importance": "10",
      "preview": "./stages.png",
      "file": "",
      "categories": [
        "School Projects",
        "System Tools"
      ],
      "details": {
        "fr": "Pas de détails supplémentaires",
        "en": "No additional details"
      }
    },
    {
      "id": 13,
      "name": "Pecking Pairs",
      "description": {
        "en": "A memory game built in a team using .NET MAUI.",
        "fr": "Un jeu de memory créé en équipe avec .NET MAUI."
      },
      "importance": "64",
      "preview": "./peckingpairs.png",
      "file": "",
      "categories": [
        "School Projects",
        "Software Development"
      ],
      "details": {
        "fr": "<h3>Contexte</h3>Ce projet en groupes de 3 représentait le projet final de la première année de BUT informatique: il applique beaucoup de compétences comme la gestion de projet et la programmation orientée objet.<h3>Objectifs</h3>Il nous était demandé de créer un jeu de plateau de type grille, avec .NET MAUI. Mon groupe a choisi un jeu de memory arrangé.<br/>Nous avons du gérer toute la planification et le suivi du projet aussi bien que la documentation du code, et le contrôle de qualité avec les outils Drone et Sonar.<h3>Livrables</h3>De nombreux jalons ont été imposés, où nous avons rendu des comptes rendus de suivi de projet. Au final, une vidéo de promotion a été réalisée en plus de la documentation complète du code.<h3>Compétences acquises</h3>J'ai appris à collaborer sur une codebase complexe et grandissante composée de nombreux modules.<br/>J'ai appris à concevoir une application de A à Z, en commencant par les sketches, persona et storyboards, passant par la documentation et la gestion de projet.<br/>J'ai également appris à créer des diagrammes UML comme les diagrammes de classes, de paquetages ou de cas d'utilisation.",
        "en": "<h3>Context</h3>This 3-person group project was the final project of our first year in my CS bachelor. It applied many skills like project management and object-oriented programming.<h3>Goals</h3>We were asked to build a grid-style board game using .NET MAUI. My group chose a modified memory game.<br/>We handled all planning, code documentation, and quality control using tools like Drone and Sonar.<h3>Products</h3>We had multiple milestones where we submitted project follow-up reports. In the end, we delivered a promo video alongside complete documentation.<h3>Skills developed</h3>I learned to collaborate on a growing and modular codebase, to design a full application from sketches to storyboards and documentation, and to produce UML diagrams (class, package, use case…)."
      }
    },
    {
      "id": 14,
      "name": "Exploitation d'une base de données",
      "description": {
        "en": "A team project where we extracted data from datasets to a database, and performed data analysis in Python.",
        "fr": "Un projet en équipe où nous avons extrait des données de jeux de données vers une base, et réalisé une analyse en Python."
      },
      "importance": "42",
      "preview": "./data.png",
      "file": "",
      "categories": [
        "School Projects",
        "Data & Analysis"
      ],
      "details": {
        "fr": "<h3>Contexte</h3>Nous avons extrait les données d'études récupérées en ligne. Mon groupe de 4 personnes a choisi d'analyser des données sur les troubles mentaux.<h3>Objectifs</h3>Nous devions créer une base de données pour tout organiser.<br/>Puis nous avons réalisé une analyse complète avec les outils Pandas, SQLalchemy et Matplotlib en Python.<h3>Livrables</h3>Nous avons généré des graphes de différents types.<br/>Le tout a été présenté lors d'un oral en anglais.<h3>Compétences acquises</h3>J'ai appris à concevoir une base de données, à travailler en équipe, à générer et interpréter différents types de représentations graphiques...",
        "en": "<h3>Context</h3>We extracted study data gathered online. My group of four people chose to analyze data on mental health disorders.<h3>Goals</h3>We had to create a database to organize everything.<br/>Then, we carried out a complete analysis using Pandas, SQLAlchemy, and Matplotlib in Python.<h3>Deliverables</h3>We generated various types of graphs.<br/>Everything was presented during an oral presentation in English.<h3>Skills acquired</h3>I learned how to design a database, work in a team, and generate and interpret different types of graphical representations..."
      }
    },
    {
      "id": 15,
      "name": "hyprkeymap",
      "description": {
        "en": "A Hyprland key bindings manager written in Rust. This is a rewrite of my C++ hyprbindings",
        "fr": "Un gestionnaire de raccourcis clavier pour Hyprland, écrit en Rust. C'est une recréation de mon hyprbindings C++"
      },
      "importance": "60",
      "preview": "./keymap.png",
      "file": "https://github.com/eiiko6/hyprkeymap",
      "categories": [
        "Linux & Config",
        "Scripting & Automation",
        "Rust",
        "System Tools"
      ],
      "details": {
        "fr": "J'ai appris le parsing d'arguments en ligne de commande avec Clap, et j'ai fait du parsing de config custom.",
        "en": "I learned about CLI argument parsing with Clap and I did some custom config file parsing."
      }
    },
    {
      "id": 16,
      "name": "Rust SQL Trainer",
      "description": {
        "en": "A CLI program that provides exercises on SQL queries.",
        "fr": "Un programme en CLI qui propose des exercices sur des requêtes SQL."
      },
      "importance": "49",
      "preview": "./rsqlt.png",
      "file": "https://github.com/eiiko6/rustsqltrainer",
      "categories": [
        "Rust",
        "Data & Analysis"
      ],
      "details": {
        "fr": "<h3>Contexte</h3>J'ai utilisé mes connaissances en SQL pour créer une solution à mes révisions avant les examens finaux.<h3>Compétences acquises</h3>J'avais appris les bases de la gestion de base de données depuis un wrapper python: c'est tout aussi simple en Rust!<br/>J'ai véritablement innové pour ce projet, je voulais que ce soit un moyen accessible de s'entrainer en SQL, sans avoir à setup un gros server postgres comme on a appris en cours.",
        "en": "<h3>Context</h3>I used my modest knowledge in databases to create a solution to help with studying before final exams.<h3>Skills Acquired</h3>I had learned the basics of database management through SqlAlchemy in Python: it's just as simple in Rust!<br/>I truly innovated for this project—I wanted it to be an accessible way to practice SQL, without having to set up a heavy PostgreSQL server like we were taught in class."
      }
    }
  ]
}
